# GetCurrentSolutionPartTypeIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartBrowserChangedEventArgs..::..GetCurrentSolutionPartTypeIds Method
FabricationPartBrowserChangedEventArgs Class See Also
---
Returns set of fabrication part types that are used in the currently selected solution.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ISet<ElementId> GetCurrentSolutionPartTypeIds()
```

Visual Basic
---
```text
Public Function GetCurrentSolutionPartTypeIds As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetCurrentSolutionPartTypeIds()
```

# ### Return Value
The set of ElementIds.
# See Also
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace